app/controllers/api_national_park_controller.rb

  def create
    json_response NationalPark.create(name: params[:name], url: params[:url])
---
INSERT INTO "national_parks" ("name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Grand Canyon National Park"], ["url", "google.com"], ["created_at", "2018-04-09 14:55:15.563655"], ["updated_at", "2018-04-09 14:55:15.563655"]]